---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralNumberOfStuds
source: html/7bcc33cb-be42-a95a-e6f0-c42418e2623b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralNumberOfStuds Property

"Number of studs"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralNumberOfStuds { get; }
```